luck_desc = [
    {
        "charaid": ["1"],
        "_name": "特别周",
        "type": [
            {
                "good-luck": 10,#绝好调
                "content": "夢に向かって駆け抜けます！"
            },
            {
                "good-luck": 10,#绝好调
                "content": "私たちの夢は、日本一のウマ娘っ！一緒に叶えましょうね、トレーナーさん！"
            },
            {
                "good-luck": 7,#好调
                "content": "なんだか調子がいい気がします！"
            },
            {
                "good-luck": 7,#好调
                "content": "早く早く、レースがしたいです！今なら思いっきり力が出せます！"
            },
            {
                "good-luck": 5,#普通
                "content": "メニューはどうしますか？"
            },
            {
                "good-luck": -7,#不调
                "content": "ふぅ…体が少し重いです～…。"
            },
            {
                "good-luck": -10,#絶不調
                "content": "あげません！"
            }
        ]
    },
    {
        "charaid": ["2"],
        "_name": "无声铃鹿",
        "type": [
            {
                "good-luck": 10,
                "content": "先頭の景色…必ずこの目で見てきます！"
            },
            {
                "good-luck": 7,
                "content": "なんだか体が軽い…！"
            },
            {
                "good-luck": 7,
                "content": "うんっ、脚が軽い…！レースでも速く走れそうな気がします！"
            },{
                "good-luck": 5,
                "content": "今日はどうしましょうか？"
            },
            {
                "good-luck": -7,
                "content": "体が重い…？ううん、まだ大丈夫…なはず…。"
            },
            {
                "good-luck": -10,
                "content": "うぅ、力が出ない…。走りたいのに…！"
            }
        ]
    },
    {
        "charaid": ["3"],
        "_name": "东海帝王",
        "type": [
            {
                "good-luck": 10,
                "content": "えっへん、見たかっ！これがテイオー様の実力だぁ！"
            },
            {
                "good-luck": 7,
                "content": "さあ、気合い入れていくよー！"
            },
            {
                "good-luck": 5,
                "content": "ボクは準備オッケー！ねぇねぇ、トレーナーは？まだ～？"
            },
            {
                "good-luck": -7,
                "content": "うーん、なんか体が重いなー…。どうしちゃったんだろー。"
            },
            {
                "good-luck": -10,
                "content": "なんかね、体がうまく動かないんだ…。うぅ～っ、モヤモヤするなぁ…！"
            }
        ]
    },
    {
        "charaid": ["4"],
        "_name": "丸善斯基",
        "type": [
            {
                "good-luck": 10,
                "content": "ドライブでもレースでも、目的地に超スピードで連れてってあげる。ちゃ～んと付き合ってね♪"
            },
            {
                "good-luck": 10,
                "content": " 気持ちは絶好調のノリノリよ！アクセル踏みぬくくらいの勢いで全員ぶち抜いてあげる！"
            },
            {
                "good-luck": 7,
                "content": "うん、コンディションも上々。一緒に頑張ってくれたあなたのためにも勝ってくるからね♪"
            },
            {
                "good-luck": 7,
                "content": "もうすぐレースの時間ね。トレーナーちゃん、応援よろぴく！"
            },
            {
                "good-luck": 5,
                "content": "不安がないわけじゃないけど…やることはやってきたし、あとはあたしに任せておいて♪"
            },
            {
                "good-luck": 5,
                "content": "少しくらい準備不足でも平気よ♪あたしのこと信じて、どーんと構えてて！ "
            },
            {
                "good-luck": -7,
                "content": " こんな状態で気持ちよく走れるのかな…。ううん、なんでもない！"
            },
            {
                "good-luck": -10,
                "content": "大事なレースだもの、負けるなんてナッシング！もう気分はアゲアゲよ！"
            }
        ]
    },
    {
        "charaid": ["5"],
        "_name": "小栗帽",
        "type": [
            {
                "good-luck": 10,
                "content": "故郷のみんなに喜んでもらえるよう、これからも…頑張ろう。"
            },
            {
                "good-luck": 10,
                "content": "ほっほっひっふ～っ！いい調子だ！なんでも言ってくれ！"
            },
            {
                "good-luck": 7,
                "content": "ふむ…今日はいい気分だ。どんどんトレーニングをしよう！ "
            },
            {
                "good-luck": 7,
                "content": " いっぱい食べたし、今日は調子がいいぞ！"
            },
            {
                "good-luck": 5,
                "content": "トレーニングなら、いつでもいけるぞ。 "
            },
            {
                "good-luck": 5,
                "content": "トレーナー…頼りにしているぞ。 "
            },
            {
                "good-luck": -7,
                "content": "む…少し疲れがあるみたいだ。"
            },
            {
                "good-luck": -10,
                "content": "どうにも調子が悪い。寝不足かな…。 "
            }
        ]
    },
    {
        "charaid": ["6"],
        "_name": "黄金船",
        "type": [
            {
                "good-luck": 10,
                "content": "なあ、100年後ヒマ？空いてたら宇宙行こーぜ。"
            },
            {
                "good-luck": 10,
                "content": "オメーの部屋、煙突ねーよな？オッケー！じゃあ事前に穴開けてから侵入するな☆"
            },
            {
                "good-luck": 7,
                "content": "うおおおおーー！！待ちきれねえぜ！イベントッ！ "
            },
            {
                "good-luck": 7,
                "content": "準備はバッチリだ！！金銀財宝、掘り当てようぜ！！ "
            },
            {
                "good-luck": 5,
                "content": " なんも考えねーのが1番。空でも見ながら走るかな～。"
            },
            {
                "good-luck": 5,
                "content": "ま、適当に走れば、うまくいくだろ！ "
            },
            {
                "good-luck": -7,
                "content": " 生まれ変わったらカタツムリにでもなるかな…。"
            },
            {
                "good-luck": -10,
                "content": " アタシがレース中に止まったら、背負って代わりにゴールしてくれよな…。"
            }
        ]
    },
    {
        "charaid": ["7"],
        "_name": "伏特加",
        "type": [
            {
                "good-luck": 10,
                "content": "仕上がり最高ッ！勝利の女神とタンデム、してみせるぜっ！"
            },
            {
                "good-luck": 10,
                "content": "ウォォオオッ！絶・好・調！！なんだってできる気がするぜ！"
            },
            {
                "good-luck": 7,
                "content": "気合い充分！どんなもんでもかまわねぇ。やり遂げてみせるぜ！ "
            },
            {
                "good-luck": 7,
                "content": " コンディション良好！いい疾風に乗れそうだな。"
            },
            {
                "good-luck": 5,
                "content": "調子悪くねーし、今まで通り走れたら余裕だろ。 "
            },
            {
                "good-luck": 5,
                "content": "準備万全、とは言えねーけど…どうなるかは最後までわからねぇ。それがレースの楽しさだからな！ "
            },
            {
                "good-luck": -7,
                "content": "あー！力出ねぇ～！けど、こういう時こそ踏ん張らねーと。だよなっ！ "
            },
            {
                "good-luck": -10,
                "content": "くっそ！体が重てぇ。…けど、あきらめねーぜ。ここであがいてこそ、俺だからな！ "
            }
        ]
    },
    {
        "charaid": ["8"],
        "_name": "大和赤骥",
        "type": [
            {
                "good-luck": 10,
                "content": "アタシは1番のウマ娘になる。アンタも1番のトレーナーになってしっかりついてきなさい！"
            },
            {
                "good-luck": 10,
                "content": "文句なしの絶好調！見てなさい、アタシの最高の走り！"
            },
            {
                "good-luck": 7,
                "content": "うん、いい調子！あとは力を出し切るだけね！ "
            },
            {
                "good-luck": 7,
                "content": "このレースに向けて頑張ってきたんだもの。勝ってみせるわ。"
            },
            {
                "good-luck": 5,
                "content": "調子は悪くないんだから。力は発揮しきれるはずよ。 "
            },
            {
                "good-luck": 5,
                "content": "なによ？なんか不安なわけ？大丈夫、やってやるわよ。きっと…大丈夫…！ "
            },
            {
                "good-luck": -7,
                "content": "アタシ、本当に1番になれるのかしら…？ "
            },
            {
                "good-luck": -10,
                "content": "体が重い…。もしかしてオーバーワーク…？ "
            }
        ]
    },
    {
        "charaid": ["9"],
        "_name": "大树快车",
        "type": [
            {
                "good-luck": 10,
                "content": "イエース！パーフェクトなワタシデス！"
            },
            {
                "good-luck": 10,
                "content": " イッツ・ア・トレーニングタイム！ワイルドに駆け抜けマスヨ～！"
            },
            {
                "good-luck": 7,
                "content": "ハウディ！トレーナーさん、なにから始めまショウカ！"
            },
            {
                "good-luck": 7,
                "content": " BANG！さぁ世界に風穴をあけまショウ！"
            },
            {
                "good-luck": 5,
                "content": "センターをゲットするためにも！トレーナーさんと一緒に鍛えマスヨ～！"
            },
            {
                "good-luck": 5,
                "content": "今日も頑張りマスヨ～！"
            },
            {
                "good-luck": -7,
                "content": "ノ～…脚がハートについてこないデース。 "
            },
            {
                "good-luck": -10,
                "content": "ノー、負けマシタ～！"
            }
        ]
    },
    {
        "charaid": ["10"],
        "_name": "草上飞",
        "type": [
            {
                "good-luck": 10,
                "content": "ウマ娘の頂点を目指すこの道…。その果てまで、どうかお付き合いくださいませ。"
            },
            {
                "good-luck": 10,
                "content": " 準備は万全。最高の走りをお見せしますね。"
            },
            {
                "good-luck": 7,
                "content": "平常心で落ち着いて。頑張っていきましょう～。 "
            },
            {
                "good-luck": 7,
                "content": "今の私には勢いがありますし、レースでも『追風に帆を上げ』て勝利を頂きましょう♪ "
            },
            {
                "good-luck": 5,
                "content": "さて、レースですね。行ってまいります♪"
            },
            {
                "good-luck": 5,
                "content": "『水を知る者は水に溺る』とも言いますし…調子が悪くないからと言って油断はしたくないですね～。"
            },
            {
                "good-luck": -7,
                "content": "少々体が重いですが…大丈夫です、いけますから。 "
            },
            {
                "good-luck": -10,
                "content": "少々の困難はあれど…気持ちで負けるつもりは、さらさらありませんから。"
            }
        ]
    },
    {
        "charaid": ["11","31"],
        "_name": "目白麦昆",
        "type": [
            {
                "good-luck": 10,
                "content": "この瞬間を待ちわびておりました。走る準備は万全ですわ！"
            },
            {
                "good-luck": 10,
                "content": " ふふっ、今ならどんなトレーニングでもこなせる気がします！"
            },
            {
                "good-luck": 7,
                "content": "いつも以上の力が出せそうです。レース開始が待ち遠しいですわね。"
            },
            {
                "good-luck": 7,
                "content": "鍛錬の成果を発揮し、必ずや勝利を勝ち取って参ります！"
            },
            {
                "good-luck": 5,
                "content": "普段通りの力を出せるよう、精一杯頑張ります。"
            },
            {
                "good-luck": 5,
                "content": "全力を出せば、なんとか…いえ、どうにかしてみせます。"
            },
            {
                "good-luck": -7,
                "content": "集中、集中…ふぅ…。心を乱さないようにしないと…。"
            },
            {
                "good-luck": -10,
                "content": "またレース…ですか？あまり続くと、体に影響が出てしまいそうですが…。"
            }
        ]
    },
    {
        "charaid": ["12"],
        "_name": "神鹰",
        "type": [
            {
                "good-luck": 10,
                "content": "豪華、絢爛、クリスマスツリー！エルと一緒にてっぺんの星、飾り付けましょう！"
            },
            {
                "good-luck": 10,
                "content": "最速、最高、世界最強！そして…アナタの担当ウマ娘！エルコンドルパサー、ここに入場！"
            },
            {
                "good-luck": 7,
                "content": "燃えてきたぁっ！エル、火傷するくらい熱いトレーニングを所望するデス！"
            },
            {
                "good-luck": 7,
                "content": "エルコンドルパサー、ここに入場デス！さぁっ、メニューはどうしますか？ "
            },
            {
                "good-luck": 5,
                "content": "それでは元気に、愉快に、痛快に！トレーニングと参りましょう！ "
            },
            {
                "good-luck": 5,
                "content": "いつも通りの力が出せたら、負けるなんてことありえませんっ！ "
            },
            {
                "good-luck": -7,
                "content": "アタシの体、こんなに動かなかったっけ…？どうしちゃったんだろう…。 "
            },
            {
                "good-luck": -10,
                "content": "なんだか調子がよくないかも…こ、こんなのじゃ、パパに顔向けできません…！"
            }
        ]
    },
    {
        "charaid": ["13"],
        "_name": "好歌剧",
        "type": [
            {
                "good-luck": 10,
                "content": "君の言葉は何よりもまっすぐだ。だからこそ信じられる。ふふっ、これからも頼りにしているよ。"
            },
            {
                "good-luck": 10,
                "content": "嗚呼、すでに頭の中に鳴り響いているよ…ボクを称える勝利のファンファーレが…！！"
            },
            {
                "good-luck": 7,
                "content": "今のボクを一言で表すならば、そう…パーフェクトッ！！"
            },
            {
                "good-luck": 7,
                "content": "胸の奥から情熱が湧いてくるようだ…！"
            },
            {
                "good-luck": 5,
                "content": " ボクの活躍をしかと見届けてくれたまえ。"
            },
            {
                "good-luck": 5,
                "content": " “覇王”として、堂々と走ってみせよう。"
            },
            {
                "good-luck": -7,
                "content": " 状態が悪い時こそ、地力が試されるというもの…いいよ、やってみようじゃないか。"
            },
            {
                "good-luck": -10,
                "content": "くっ…ボクが輝きを失っては誰が世界を照らすというんだ…ッ！"
            }
        ]
    },
    {
        "charaid": ["14"],
        "_name": "皇帝",
        "type": [
            {
                "good-luck": 10,
                "content": "調子は『最高』だ。トレーニングに『さあ行こう』！…ふふふ、冗談も冴えている。"
            },
            {
                "good-luck": 10,
                "content": "今日はやる気で溢れている。“皇帝”の名に恥じない走りが出来そうだ。"
            },
            {
                "good-luck": 7,
                "content": "『頂点を目指す』という目標が私を奮い立たせる。今日も有意義なトレーニングをしよう。 "
            },
            {
                "good-luck": 7,
                "content": "体の底から気力が溢れ出るようだ。威風堂々、レースを走りぬいてこよう。"
            },
            {
                "good-luck": 5,
                "content": "日々の積み重ねは必ず目標への糧となっている。今日もトレーニングに勤しむとしよう。"
            },
            {
                "good-luck": 5,
                "content": "気持ちは落ち着いている。あとは力の限り走るだけだ。 "
            },
            {
                "good-luck": -7,
                "content": "うむ…どうにも調子がすぐれないがこの程度で泣きごとなど言うわけにはいかないな。"
            },
            {
                "good-luck": -10,
                "content": "少しばかり疲れが溜まっているようだ…。"
            }
        ]
    },
    {
        "charaid": ["15"],
        "_name": "气槽",
        "type": [
            {
                "good-luck": 10,
                "content": "行くぞ！後続たちにこの背を見せてやる…！"
            },
            {
                "good-luck": 10,
                "content": "勝利への道を、この脚で切り拓いてみせる。"
            },
            {
                "good-luck": 7,
                "content": "1日穏やかに過ごせたおかげか、気分がいい。これならば集中してトレーニングに打ち込めるな。"
            },
            {
                "good-luck": 7,
                "content": "力がみなぎっている…！鍛える好機だ、始めるぞ！"
            },
            {
                "good-luck": 5,
                "content": "闘志を燃やさねばいけない…わかってはいるが…ふぅ。"
            },
            {
                "good-luck": 5,
                "content": "好調とは言えんな。だが…ハッ、だからこそ覆し甲斐がある。"
            },
            {
                "good-luck": -7,
                "content": "くっ…脚が重い。今は休息が必要か…。"
            },
            {
                "good-luck": -10,
                "content": "どうにも頭がクラクラする…。体力の限界か…？"
            }
        ]
    },
    {
        "charaid": ["16"],
        "_name": "琵琶晨光",
        "type": [
            {
                "good-luck": 10,
                "content": "；私は――より勝利に近づける理論をどこまでも追い求めていきたい。頼り甲斐のある相棒と共に、ね。"
            },
            {
                "good-luck": 10,
                "content": "調子は良好、後は…最後の詰めだ。トレーナー君の激励をくれ。その一言が、勝利へのピースだ！"
            },
            {
                "good-luck": 7,
                "content": "全てはこの日のために…後は我々の理論の正しさを、皆に証明するだけだ。"
            },
            {
                "good-luck": 7,
                "content": "概ね想定通りの仕上がりだな。ならば…本番でも想定通り、勝利という結果を掴むのみだ。"
            },
            {
                "good-luck": 5,
                "content": "…ふむ、存外気づかれないな。いや、ヘアオイルを変えたんだが…サラサラな印象にはまだ遠い、か。 "
            },
            {
                "good-luck": 5,
                "content": "今日はどの式を試そうか。君の選んだ場所で検証しよう。 "
            },
            {
                "good-luck": -7,
                "content": "――…っああ、すまない。少し考え事をしてしまっていた…。"
            },
            {
                "good-luck": -10,
                "content": "はぁ…どうにも調子が出ないな。トレーニングで解消できるか？…かえって逆効果だろうな。"
            }
        ]
    },
    {
        "charaid": ["17"],
        "_name": "重炮",
        "type": [
            {
                "good-luck": 10,
                "content": "燃料満タン！離陸準備オーライ！いつでもテイクオフいけるよ！今なら本当に飛べちゃうかも！？"
            },
            {
                "good-luck": 10,
                "content": " 今のマヤならどんな走り方でも1番になれる気がするよ！スタートが楽しみ～☆！"
            },
            {
                "good-luck": 7,
                "content": "勝利に向けて調子も上昇中！これならマヤ、いっぱいキラキラできる気がする！"
            },
            {
                "good-luck": 7,
                "content": "ついに本番だね！このレース、すっごく楽しく走れそう！ワクワクが止まらないよ～！"
            },
            {
                "good-luck": 5,
                "content": "どうやって走ろうかな～？トレーナーちゃんは、どうしたら1番楽しく走れると思う？"
            },
            {
                "good-luck": 5,
                "content": "大丈夫、わかってるよ！いつも通り走ればいいんだよね！"
            },
            {
                "good-luck": -7,
                "content": "あれれ…？なんだかうまく体が動かない…？マヤ、どうしちゃったのかな…？"
            },
            {
                "good-luck": -10,
                "content": "んん～…？なんだか元気が急降下しちゃってる…？"
            }
        ]
    },
    {
        "charaid": ["18"],
        "_name": "美浦波旁",
        "type": [
            {
                "good-luck": 10,
                "content": "調整は万全。勝利確率は、状態に比例していると判断します。"
            },
            {
                "good-luck": 10,
                "content": "ステータス・弱気は排除。どんな状況であろうとも、必ず勝利を。"
            },
            {
                "good-luck": 7,
                "content": "トレーニングによる調整結果を算出…状態は『良好』を示しています。"
            },
            {
                "good-luck": 7,
                "content": "仕上がりは完璧と判断。最良の結果が得られるかと。"
            },
            {
                "good-luck": 5,
                "content": "目標レース、分析完了。あらゆる状況に対応可能。指示をお願いします、マスター。"
            },
            {
                "good-luck": 5,
                "content": "適切なトレーニング配分により十分な仕上がりを確認。…やれます。"
            },
            {
                "good-luck": -7,
                "content": "出力に問題あり…ですが…まだ続行可能と判断します。"
            },
            {
                "good-luck": -10,
                "content": "全機能、出力低下中…。ステータス『絶不調』と推測されます…。"
            }
        ]
    },
    {
        "charaid": ["19"],
        "_name": "目白赖恩",
        "type": [
            {
                "good-luck": 10,
                "content": "大腿四頭筋が最っ高に仕上がってます！まるであたしに『走れ』って言ってるみたいに！"
            },
            {
                "good-luck": 10,
                "content": " 今日のあたしならどんな相手にも勝てる…！だってこんなにも腹筋群がカッチカチなんですから！"
            },
            {
                "good-luck": 7,
                "content": "くぅ～っ…！！ハムストリングスが今にも走り出しそう…っ！！"
            },
            {
                "good-luck": 7,
                "content": "今日もトレーナーさんと筋肉を信じて走ります！"
            },
            {
                "good-luck": 5,
                "content": "不安はありますけど、レースに出ればそんなの関係ないですから。"
            },
            {
                "good-luck": 5,
                "content": "応援してくれる人がいるんだ…！調子が悪くたって、絶対に負けたくない…！"
            },
            {
                "good-luck": -7,
                "content": "あれ、筋肉にいつものハリがない…気のせいかな…？"
            },
            {
                "good-luck": -10,
                "content": "すみません、これ以上レースに出るとさすがに体調に影響が出るかと…。"
            }
        ]
    },
    {
        "charaid": ["20"],
        "_name": "米浴",
        "type": [
            {
                "good-luck": 10,
                "content": "うぅ～…。がんばれライス…がんばれぇ～…。"
            },
            {
                "good-luck": 10,
                "content": "お兄さまと、いっぱいいっぱいトレーニングしたもん…！がんばってくるね。"
            },
            {
                "good-luck": 7,
                "content": "あとは精いっぱい走るだけ…そうだよね、お兄さま…！"
            },
            {
                "good-luck": 7,
                "content": "お兄さま、トレーニングしよ？いまならいっぱいがんばれそうだから。"
            },
            {
                "good-luck": 5,
                "content": "ライスにできることなんて、あるのかなぁ…。 "
            },
            {
                "good-luck": 5,
                "content": "最後までしっかり走るね…！がんばるぞー、おー！"
            },
            {
                "good-luck": -7,
                "content": "ふ、震えてきちゃった…。あの、お兄さま…少しだけ…手、握っててもいい…？ "
            },
            {
                "good-luck": -10,
                "content": "ふぅ…ちょっとだけ、疲れてる…のかな…。"
            }
        ]
    },
    {
        "charaid": ["21"],
        "_name": "爱丽速子",
        "type": [
            {
                "good-luck": 10,
                "content": "君は私のモルモットではあるが、同時に助手でもあるんだ。しっかり働いてくれたまえよ？"
            },
            {
                "good-luck": 10,
                "content": " クククッ…実にいい気分だ！昨日の実験はやはり成功だった。今なら素晴らしい成果を残せるぞ！"
            },
            {
                "good-luck": 7,
                "content": "今日の私はいつにも増して可能性に満ちている…！実証してみようじゃないか！"
            },
            {
                "good-luck": 7,
                "content": "ふぅン…なんだか体が軽いな。これならいつも以上に集中して研究に取り組めそうだ。"
            },
            {
                "good-luck": 5,
                "content": "さっさと始めようか。やる気を持続させるのもなかなかに大変だからね。"
            },
            {
                "good-luck": 5,
                "content": "気分も乗っているし、悪くない。これでどの程度の結果を出せるか、実験開始と行こう。"
            },
            {
                "good-luck": -7,
                "content": "…私のやる気は、今行方不明中のようでね…。安心したまえ、やることはやるさ。"
            },
            {
                "good-luck": -10,
                "content": "あー…どうにも調子が悪いな…。とは言え、今日の予定くらいはこなさないと次の実験に影響が…。"
            }
        ]
    }
]
